{
  "auto_mapping": {
    "base_model_class": "CLIPModel",
    "parent_library": "transformers.models.clip.modeling_clip"
  },
  "base_model_name_or_path": "openai/clip-vit-base-patch32",
  "bias": "lora_only",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 2,
  "lora_dropout": 0.2,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 1,
  "revision": null,
  "target_modules": [
    "k_proj",
    "v_proj",
    "q_proj",
    "out_proj",
    "fc1",
    "fc2",
    "visual_projection",
    "text_projection"
  ],
  "task_type": null
}